// Автор: Вадим Плахтинский.
// «Восьминашки» – упрощенный вариант известной головоломки «Пятнашки».
// Восемь костяшек, пронумерованных от 1 до 8, расставлены по ячейкам игровой доски 3 на 3, одна ячейка при этом остается пустой.
// За один ход разрешается передвинуть одну из костяшек, расположенных рядом с пустой ячейкой, на свободное место.
// Цель игры – для заданной начальной конфигурации игровой доски за минимальное число ходов получить выигрышную конфигурацию (пустая ячейка обозначена нулем).

#include "CPuzzle.h"

int main()
{
    CPuzzle n;
    return 0;
}